# Learning Pandas Basics

***Importing the necessary libraries***

In [1]:
import numpy as np
import pandas as pd

***Importing the dataset into the dataframe***

In [2]:
filepath = "../input/retail-data-customer-summary-learn-pandas-basics/1_Sales.csv"
df = pd.read_csv(filepath)

In [3]:
df.head()

  SalesRep Region Month    Sales  Units Sold
0      Amy  North   Jan  23040.0       239.0
1      Amy  North   Feb  24131.0        79.0
2      Amy  North   Mar  24646.0        71.0
3      Amy  North   Apr  22047.0        71.0
4      Amy  North   May  24971.0         NaN

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48 entries, 0 to 47
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   SalesRep    48 non-null     object
 1   Region      48 non-null     object
 2   Month       48 non-null     object
 3   Sales       47 non-null     float64
 4   Units Sold  47 non-null     float64
dtypes: float64(2), object(3)
memory usage: 2.0+ KB

In [5]:
df.describe()

              Sales  Units Sold
count     47.000000   47.000000
mean   24209.425532  206.617021
std     2671.207948  204.332269
min    19625.000000   68.000000
25%    22348.500000   86.500000
50%    24218.000000  114.000000
75%    25742.000000  227.000000
max    29953.000000  852.000000

***Checking for Null values***

In [6]:
df.isnull().sum()

SalesRep      0
Region        0
Month         0
Sales         1
Units Sold    1
dtype: int64

***Replacing the null values with the mean values.***

In [7]:
sales_mean = df.Sales.mean()
Units_sold_mean = df["Units Sold"].mean()

df['Sales'].fillna(value = sales_mean, inplace = True)
df['Units Sold'].fillna(value = Units_sold_mean, inplace = True)

print("DataFrame updated by filling null values")

DataFrame updated by filling null values

***Updated DataFrame***

In [8]:
df.head()

  SalesRep Region Month    Sales  Units Sold
0      Amy  North   Jan  23040.0  239.000000
1      Amy  North   Feb  24131.0   79.000000
2      Amy  North   Mar  24646.0   71.000000
3      Amy  North   Apr  22047.0   71.000000
4      Amy  North   May  24971.0  206.617021

***On comparing from the previous dataframe we can easily see that the NaN value is being filled by the mean value.***

***Importing new dataset***

In [9]:
Retail_data = pd.read_csv("../input/retail-data-customer-summary-learn-pandas-basics/Retail_Data_Customers_Summary.csv")
Retail_data.head()

,customer_id,tran_amount_2011,tran_amount_2012,tran_amount_2013,tran_amount_2014,tran_amount_2015,transactions_2011,transactions_2012,transactions_2013,transactions_2014,transactions_2015,First_Transaction,Latest_Transaction
0,CS2945,153.0,516.0,173.0,1029.0,40.0,2.0,7.0,3.0,13.0,1.0,18-May-11,08-Mar-15
1,CS4074,269.0,429.0,737.0,1027.0,NaN,3.0,6.0,10.0,15.0,NaN,29-May-11,05-Dec-14
2,CS4798,153.0,536.0,414.0,1001.0,47.0,2.0,7.0,6.0,11.0,1.0,01-Jul-11,21-Feb-15
3,CS4424,547.0,380.0,921.0,984.0,101.0,7.0,5.0,13.0,13.0,1.0,25-May-11,19-Jan-15
4,CS5057,290.0,235.0,509.0,974.0,NaN,4.0,4.0,6.0,12.0,NaN,10-Jul-11,02-Dec-14

In [10]:
print(Retail_data.shape)
print(Retail_data.size)

(6889, 13)
89557

***Checking for Null values***

In [11]:
Retail_data.isnull().sum()

customer_id              0
tran_amount_2011       388
tran_amount_2012        80
tran_amount_2013        85
tran_amount_2014        88
tran_amount_2015      2664
transactions_2011      388
transactions_2012       80
transactions_2013       85
transactions_2014       88
transactions_2015     2664
First_Transaction        0
Latest_Transaction       0
dtype: int64

***Here we can see the number of null values present in different columns.We can replace the null values with 0.***

In [12]:
Retail_data.fillna(value=0,inplace = True)

***Updated dataframe***

In [13]:
Retail_data.head()

,customer_id,tran_amount_2011,tran_amount_2012,tran_amount_2013,tran_amount_2014,tran_amount_2015,transactions_2011,transactions_2012,transactions_2013,transactions_2014,transactions_2015,First_Transaction,Latest_Transaction
0,CS2945,153.0,516.0,173.0,1029.0,40.0,2.0,7.0,3.0,13.0,1.0,18-May-11,08-Mar-15
1,CS4074,269.0,429.0,737.0,1027.0,0.0,3.0,6.0,10.0,15.0,0.0,29-May-11,05-Dec-14
2,CS4798,153.0,536.0,414.0,1001.0,47.0,2.0,7.0,6.0,11.0,1.0,01-Jul-11,21-Feb-15
3,CS4424,547.0,380.0,921.0,984.0,101.0,7.0,5.0,13.0,13.0,1.0,25-May-11,19-Jan-15
4,CS5057,290.0,235.0,509.0,974.0,0.0,4.0,4.0,6.0,12.0,0.0,10-Jul-11,02-Dec-14

***Creating new columns in the dataframe Total Customer Spend, Total customer transaction & Customer ATV***

In [14]:
Retail_data['Total Customer Spend'] = Retail_data.iloc[:,1:6].sum(axis=1)
Retail_data['Total Customer Transaction'] = Retail_data.iloc[:,6:-3].sum(axis=1)
Retail_data['Customer ATV'] = np.round(Retail_data['Total Customer Spend'].div(Retail_data['Total Customer Transaction']),2)
Retail_data.head()

,customer_id,tran_amount_2011,tran_amount_2012,tran_amount_2013,tran_amount_2014,tran_amount_2015,transactions_2011,transactions_2012,transactions_2013,transactions_2014,transactions_2015,First_Transaction,Latest_Transaction,Total Customer Spend,Total Customer Transaction,Customer ATV
0,CS2945,153.0,516.0,173.0,1029.0,40.0,2.0,7.0,3.0,13.0,1.0,18-May-11,08-Mar-15,1911.0,26.0,73.50
1,CS4074,269.0,429.0,737.0,1027.0,0.0,3.0,6.0,10.0,15.0,0.0,29-May-11,05-Dec-14,2462.0,34.0,72.41
2,CS4798,153.0,536.0,414.0,1001.0,47.0,2.0,7.0,6.0,11.0,1.0,01-Jul-11,21-Feb-15,2151.0,27.0,79.67
3,CS4424,547.0,380.0,921.0,984.0,101.0,7.0,5.0,13.0,13.0,1.0,25-May-11,19-Jan-15,2933.0,39.0,75.21
4,CS5057,290.0,235.0,509.0,974.0,0.0,4.0,4.0,6.0,12.0,0.0,10-Jul-11,02-Dec-14,2008.0,26.0,77.23

***Customer with highest transactions***

In [15]:
Retail_data[Retail_data['Total Customer Transaction']  == Retail_data['Total Customer Transaction'].max()]

,customer_id,tran_amount_2011,tran_amount_2012,tran_amount_2013,tran_amount_2014,tran_amount_2015,transactions_2011,transactions_2012,transactions_2013,transactions_2014,transactions_2015,First_Transaction,Latest_Transaction,Total Customer Spend,Total Customer Transaction,Customer ATV
3,CS4424,547.0,380.0,921.0,984.0,101.0,7.0,5.0,13.0,13.0,1.0,25-May-11,19-Jan-15,2933.0,39.0,75.21